In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\mrunal\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mrunal\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mrunal\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mrunal\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mrunal\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mrunal\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [24]:
data_pop = {'City':['Pune','Nashik','Mumbai','Kolhapur','Nagpur'],'Year':[2023,2023,2023,2023,2023],'Pop':[1.5,1.7,3.6,2.4,2.9]}
df = pd.DataFrame(data_pop)
df.City[0],df.Pop[0]
#df.index[df['City'] == 'Pune'] # second method for calling index
df.City[0],df.Pop[0]

('Pune', 1.5)

In [10]:
# Location Attribute
columns_required = ['Pop','Year']
df.loc[df['City'] == 'Pune',columns_required]

   Pop  Year
0  1.5  2023

In [11]:
df.loc[2,['City','Pop','Year']] # Another method to calling multiple index(here 2 indicate index value)

City    Mumbai
Pop        3.6
Year      2023
Name: 2, dtype: object

In [12]:
df.loc[[2],['City','Pop','Year']] # if we want data in table format

     City  Pop  Year
2  Mumbai  3.6  2023

In [13]:
# create table of 3 columns with random numbers(pd.DataFrame is convert array in table)
data = np.random.randint(0,20,size = (10,3))
df1 = pd.DataFrame(data, columns=['Column1','Column2','Column3'])
df1

   Column1  Column2  Column3
0        5        8        7
1       12        7       17
2        7        5       18
3        5       16       11
4        7        6        1
5       15        2        1
6       10        8       18
7        9        0        1
8        0        8        5
9        1        0        0

#### Using Random seed value will not be change

In [14]:
# random seed is store value in seed and it fixed random values(pd.DataFrame is convert array in table)
np.random.seed(20) # data store in seed and it 
data = np.random.randint(0,20,size = (10,3))
df1 = pd.DataFrame(data, columns=['Column1','Column2','Column3'])
df1

   Column1  Column2  Column3
0        3       15        9
1       11        7        2
2        0        8       19
3       16        6        6
4       16        9        5
5        7        5        2
6        6       13       11
7        3       10       11
8       13       19       14
9        0       10       11

#### Changing index,using index arguments

In [15]:
df = pd.DataFrame(df , columns = ['Year','City','Pop','Area']) # create another column with null value
df

   Year      City  Pop  Area
0  2023      Pune  1.5   NaN
1  2023    Nashik  1.7   NaN
2  2023    Mumbai  3.6   NaN
3  2023  Kolhapur  2.4   NaN
4  2023    Nagpur  2.9   NaN

In [16]:
# changing index
df = pd.DataFrame(data_pop , columns = ['Year','City','Pop'],index = [1,2,3,4,5]) 
df

   Year      City  Pop
1  2023      Pune  1.5
2  2023    Nashik  1.7
3  2023    Mumbai  3.6
4  2023  Kolhapur  2.4
5  2023    Nagpur  2.9

In [17]:
# changing index
df.index = ['A','B','C','D','E']
df

   Year      City  Pop
A  2023      Pune  1.5
B  2023    Nashik  1.7
C  2023    Mumbai  3.6
D  2023  Kolhapur  2.4
E  2023    Nagpur  2.9

In [19]:
income_per_capita = pd.Series([2000,1000,5000,3000,2000], index = [1,2,3,4,5])
income_per_capita

df['income_per_capita'] = income_per_capita
df

   Year      City  Pop  income_per_capita
A  2023      Pune  1.5                NaN
B  2023    Nashik  1.7                NaN
C  2023    Mumbai  3.6                NaN
D  2023  Kolhapur  2.4                NaN
E  2023    Nagpur  2.9                NaN

In [20]:
df['S.No.'] = np.arange(1,6)
df

   Year      City  Pop  income_per_capita  S.No.
A  2023      Pune  1.5                NaN      1
B  2023    Nashik  1.7                NaN      2
C  2023    Mumbai  3.6                NaN      3
D  2023  Kolhapur  2.4                NaN      4
E  2023    Nagpur  2.9                NaN      5

In [22]:
df = pd.DataFrame(df,columns = ['S.No.','Year','City','Pop','income_per_capita'])
df

   S.No.  Year      City  Pop  income_per_capita
A      1  2023      Pune  1.5                NaN
B      2  2023    Nashik  1.7                NaN
C      3  2023    Mumbai  3.6                NaN
D      4  2023  Kolhapur  2.4                NaN
E      5  2023    Nagpur  2.9                NaN

In [26]:
'''Question 1: Creating a DataFrame

Create a DataFrame named students with the following data:
Name	Age	Grade
Alice	24	B
Bob	22	A
Charlie	23	B
David	25	C
Eva	22	A
Write the code to create this DataFrame.
'''

student = {'Name':['Alice','Bob','Charlie','David','Eva'],'Age':[24,22,23,25,22],'Grade':['B','A','B','C','A']}
stud = pd.DataFrame(student)
stud

      Name  Age Grade
0    Alice   24     B
1      Bob   22     A
2  Charlie   23     B
3    David   25     C
4      Eva   22     A

In [31]:
'''
Question 2: Adding a New Column

Add a new column named Passed to the students DataFrame. If the grade is 'A' or 'B', 
the value should be True; otherwise, it should be False.
'''

stud = pd.DataFrame(student)
stud['Passed'] = stud['Grade'].apply(lambda grade: True if grade in ['A','B'] else False)
stud

      Name  Age Grade  Passed
0    Alice   24     B    True
1      Bob   22     A    True
2  Charlie   23     B    True
3    David   25     C   False
4      Eva   22     A    True

In [32]:
'''
Question 3: Updating Column Values Using a Series

Create a pandas Series named new_ages with the following data:
24, 23, 22, 26, 21
Update the Age column of the students DataFrame with the 
values from the new_ages Series.
'''

new_ages = pd.Series([24,23,22,26,21],index = [0,1,2,3,4])
stud['Age'] = new_ages
stud

      Name  Age Grade  Passed
0    Alice   24     B    True
1      Bob   23     A    True
2  Charlie   22     B    True
3    David   26     C   False
4      Eva   21     A    True

In [42]:
'''
Question 4: Updating Values Conditionally

Update the Grade column in the students DataFrame such that 
all students with an age greater than 23 have their grade changed to 'A+'.
'''

stud['Grade'] = stud.apply(lambda stud: '+A' if stud['Age'] >23 else stud['Grade'],axis = 1)
stud

#np.where
#np.assign

      Name  Age Grade  Passed
0    Alice   24    +A    True
1      Bob   23     A    True
2  Charlie   22     B    True
3    David   26    +A   False
4      Eva   21     A    True

In [51]:
'''
Question 5: Renaming Columns


Rename the columns of the students DataFrame from Name, Age, Grade
'''

stud.rename(columns={'Name':'Student Name','Age':'Student Age','Grade':'Student Grade','Passed':'Passed Exam'},inplace = True)
stud.rename(columns = str.upper, inplace = True)
stud

  STUDENT NAME  STUDENT AGE STUDENT GRADE  PASSED EXAM
0        Alice           24            +A         True
1          Bob           23             A         True
2      Charlie           22             B         True
3        David           26            +A        False
4          Eva           21             A         True

In [53]:
# Transpose use for converting rows into columns and columns into rows
stud.T

                   0     1        2      3     4
STUDENT NAME   Alice   Bob  Charlie  David   Eva
STUDENT AGE       24    23       22     26    21
STUDENT GRADE     +A     A        B     +A     A
PASSED EXAM     True  True     True  False  True

In [60]:
# To drop columns which have null value
stud['Gender'] = np.nan
stud = stud.dropna(axis = 1,how = 'any')
stud

  STUDENT NAME  STUDENT AGE STUDENT GRADE  PASSED EXAM
0        Alice           24            +A         True
1          Bob           23             A         True
2      Charlie           22             B         True
3        David           26            +A        False
4          Eva           21             A         True

#### HW
#### 1.practice np.where and np.assign fuctions
#### 2.read/practice all the functions related to pandas dataframe
#### 3.complete one question on dataframe added below

#### Re-indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
series_1 = pd.Series([10,20,30,40],index = ['a','b','c','d'])
series_1

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
# Reindex is used to shuffle rows
# if we add 'e' index with null value then all values convert in float because it takes larger datatype 
series_2 = series_1.reindex(['d','c','a','b','e'])
series_2

d    40.0
c    30.0
a    10.0
b    20.0
e     NaN
dtype: float64

In [7]:
series_3 = pd.Series([10,20,30,40],index = [0,3,9,12])
series_3

0     10
3     20
9     30
12    40
dtype: int64

In [11]:
# reindex in range is return number of range upto index 13 and return values which are given otherwise value will be null
series_4 = series_3.reindex(range(13))
series_4

0     10.0
1      NaN
2      NaN
3     20.0
4      NaN
5      NaN
6      NaN
7      NaN
8      NaN
9     30.0
10     NaN
11     NaN
12    40.0
dtype: float64

In [12]:
# ffilll = Forward filling
series_5 = series_3.reindex(range(13), method = 'ffill')
series_5

0     10
1     10
2     10
3     20
4     20
5     20
6     20
7     20
8     20
9     30
10    30
11    30
12    40
dtype: int64

In [13]:
# bfill = Backward filling
series_6 = series_3.reindex(range(13), method = 'bfill')
series_6

0     10
1     20
2     20
3     20
4     30
5     30
6     30
7     30
8     30
9     30
10    40
11    40
12    40
dtype: int64

In [14]:
series_2

d    40.0
c    30.0
a    10.0
b    20.0
e     NaN
dtype: float64

In [16]:
series_2.drop('e')
series_2

d    40.0
c    30.0
a    10.0
b    20.0
e     NaN
dtype: float64